{
    "vi": [
        { "keyword": "chào", "response": "Xin chào! Chào mừng đến với AgiGreen." },
        { "keyword": "hẹn gặp lại", "response": "Hẹn gặp lại bạn. Chúc một ngày tốt lành!" },
        { "keyword": "giới thiệu sản phẩm", "response": "Chúng tôi cung cấp đa dạng vật tư nông nghiệp chất lượng, từ phân bón, hạt giống đến dụng cụ trồng trọt. Bạn cần thông tin chi tiết về sản phẩm nào?" },
        { "keyword": "giá sản phẩm", "response": "Bạn có thể tìm giá của từng sản phẩm trên trang chi tiết của từng mục hàng. Nếu cần, tôi sẽ giúp bạn tìm thông tin cụ thể!" },
        { "keyword": "chính sách giao hàng", "response": "Chúng tôi giao hàng toàn quốc với nhiều phương thức vận chuyển khác nhau. Vui lòng cung cấp địa chỉ để tôi kiểm tra chi tiết." },
        { "keyword": "hỗ trợ khách hàng", "response": "Chúng tôi luôn sẵn sàng hỗ trợ bạn. Bạn có thể liên hệ qua điện thoại, email hoặc chat trực tiếp trên website." },
        { "keyword": "thanh toán", "response": "Chúng tôi hỗ trợ nhiều phương thức thanh toán như chuyển khoản ngân hàng, thẻ tín dụng và thanh toán qua ví điện tử." },
        { "keyword": "khuyến mãi", "response": "Hiện tại, chúng tôi đang có các chương trình khuyến mãi đặc biệt cho mùa vụ. Hãy xem chi tiết trên website để biết thêm thông tin!" },
        { "keyword": "hỏi về chất lượng", "response": "Chúng tôi cam kết cung cấp các sản phẩm chất lượng nhất. Nếu bạn cần thông tin chi tiết về chất lượng, tôi sẵn sàng hỗ trợ." },
        { "keyword": "cách sử dụng", "response": "Bạn cần hướng dẫn sử dụng sản phẩm nào? Tôi có thể hướng dẫn bạn chi tiết hoặc bạn có thể xem video hướng dẫn trên website." },
        { "keyword": "liên hệ", "response": "Bạn có thể liên hệ với chúng tôi qua số điện thoại, email hoặc chat trực tiếp trên website để được hỗ trợ." },
        { "keyword": "tìm kiếm sản phẩm", "response": "Hãy cho tôi biết sản phẩm bạn đang tìm, tôi sẽ giúp bạn tìm nhanh chóng trên website." },
        { "keyword": "mua hàng", "response": "Bạn có thể chọn sản phẩm và thêm vào giỏ hàng để mua. Tôi sẵn sàng hướng dẫn bạn quy trình mua hàng." },
        { "keyword": "đổi trả hàng", "response": "Chúng tôi có chính sách đổi trả hàng trong vòng 7 ngày nếu sản phẩm có lỗi hoặc không đúng với đơn đặt hàng." },
        { "keyword": "giới thiệu cửa hàng", "response": "Cửa hàng chúng tôi chuyên cung cấp vật tư nông nghiệp chất lượng từ các nhà sản xuất uy tín. Hãy khám phá các sản phẩm của chúng tôi!" },
        { "keyword": "tư vấn sản phẩm", "response": "Bạn cần tư vấn về sản phẩm nào? Tôi sẽ giúp bạn chọn sản phẩm phù hợp nhất." },
        { "keyword": "mua sỉ", "response": "Chúng tôi có chính sách đặc biệt cho các đơn hàng mua sỉ. Vui lòng liên hệ để biết thêm chi tiết." },
        { "keyword": "khách hàng doanh nghiệp", "response": "Chúng tôi phục vụ cả khách hàng doanh nghiệp với các đơn hàng lớn. Liên hệ với chúng tôi để được báo giá tốt nhất." },
        { "keyword": "giao hàng nhanh", "response": "Chúng tôi có dịch vụ giao hàng nhanh trong nội thành và nhiều khu vực khác. Hãy cung cấp địa chỉ để tôi kiểm tra thời gian giao hàng." },
        { "keyword": "giới thiệu phân bón", "response": "Chúng tôi có nhiều loại phân bón khác nhau cho từng loại cây trồng. Hãy cho tôi biết loại cây bạn trồng để tôi tư vấn sản phẩm phù hợp." },
        { "keyword": "hạt giống", "response": "Chúng tôi có hạt giống của nhiều loại cây, từ rau củ đến hoa quả. Cần tư vấn về hạt giống nào không?" },
        { "keyword": "dụng cụ trồng trọt", "response": "Chúng tôi cung cấp các dụng cụ trồng trọt chất lượng, từ cuốc xẻng đến bình xịt. Hãy cho tôi biết bạn cần dụng cụ nào." },
        { "keyword": "thời gian làm việc", "response": "Chúng tôi làm việc từ 8h đến 17h từ thứ 2 đến thứ 7. Bạn có thể liên hệ bất cứ lúc nào trong thời gian này." },
        { "keyword": "cách bảo quản phân bón", "response": "Phân bón nên được bảo quản nơi khô ráo, thoáng mát, tránh ánh nắng trực tiếp và độ ẩm cao." },
        { "keyword": "tư vấn kỹ thuật", "response": "Chúng tôi có đội ngũ chuyên gia tư vấn kỹ thuật để giúp bạn đạt hiệu quả tốt nhất trong canh tác." },
        { "keyword": "sản phẩm mới", "response": "Chúng tôi thường xuyên cập nhật các sản phẩm mới. Hãy theo dõi trang web để biết thêm chi tiết." },
        { "keyword": "thêm vào giỏ hàng", "response": "Hãy chọn sản phẩm và nhấn icon 'Thêm vào giỏ hàng' để tiếp tục mua sắm." },
        { "keyword": "khách hàng thân thiết", "response": "Chúng tôi có chương trình ưu đãi cho khách hàng thân thiết. Liên hệ để biết thêm chi tiết." },
        { "keyword": "cách chọn phân bón", "response": "Chọn phân bón phù hợp dựa vào nhu cầu dinh dưỡng của cây trồng và loại đất. Tôi có thể giúp bạn chọn phân bón đúng loại." },
        { "keyword": "năng suất cây trồng", "response": "Chúng tôi có các sản phẩm hỗ trợ tăng cường năng suất cây trồng. Hãy hỏi tôi để biết chi tiết về từng sản phẩm." },
        { "keyword": "hướng dẫn gieo trồng", "response": "Hãy cho tôi biết bạn muốn gieo trồng loại cây nào, tôi sẽ hướng dẫn bạn chi tiết cách làm." },
        { "keyword": "đánh giá sản phẩm", "response": "Bạn có thể xem các đánh giá của khách hàng khác trên trang chi tiết sản phẩm để biết chất lượng." },
        { "keyword": "công thức pha chế phân bón", "response": "Nếu bạn cần công thức pha chế phân bón, hãy cung cấp thông tin về loại phân bón để tôi tư vấn chi tiết." },
        { "keyword": "tình trạng đơn hàng", "response": "Bạn có thể kiểm tra tình trạng đơn hàng của mình bằng cách nhập mã đơn hàng trên trang 'Theo dõi đơn hàng'." },
        { "keyword": "sản phẩm được yêu thích", "response": "Dưới đây là các sản phẩm được yêu thích nhất của chúng tôi. Bạn muốn biết thông tin chi tiết về sản phẩm nào?" },
        { "keyword": "hướng dẫn sử dụng dụng cụ", "response": "Tôi có thể cung cấp hướng dẫn sử dụng chi tiết cho từng loại dụng cụ. Cần giúp đỡ về dụng cụ nào?" },
        { "keyword": "tài khoản khách hàng", "response": "Bạn có thể tạo tài khoản khách hàng để quản lý đơn hàng và lưu trữ thông tin cá nhân." },
        { "keyword": "cập nhật chương trình khuyến mãi", "response": "Chúng tôi sẽ thông báo cho bạn khi có chương trình khuyến mãi mới qua email hoặc qua website." },
        { "keyword": "hỏi về sự khác biệt giữa các loại phân", "response": "Các loại phân có thể khác nhau về thành phần dinh dưỡng và mục đích sử dụng. Tôi sẽ giúp bạn hiểu rõ hơn." },
        { "keyword": "tư vấn về sâu bệnh", "response": "Chúng tôi có các giải pháp phòng chống sâu bệnh cho cây trồng. Cần giúp đỡ về loại sâu bệnh nào?" },
        { "keyword": "sản phẩm hữu cơ", "response": "Chúng tôi có nhiều sản phẩm hữu cơ an toàn cho cây trồng. Hãy khám phá các lựa chọn này trên website." },
        { "keyword": "chế độ bảo hành", "response": "Chúng tôi có chế độ bảo hành cho các sản phẩm nhất định. Vui lòng liên hệ để biết thêm chi tiết." },
        { "keyword": "thông tin liên hệ", "response": "Thông tin liên hệ của chúng tôi có trên trang 'Liên hệ'. Bạn có thể gọi hoặc gửi email để được hỗ trợ." },
        { "keyword": "số lượng tối thiểu", "response": "Số lượng tối thiểu để đặt hàng có thể khác nhau theo từng sản phẩm. Hãy kiểm tra trang chi tiết sản phẩm để biết thêm." },
        { "keyword": "hỏi về mùa vụ", "response": "Mùa vụ của từng loại cây trồng có thể khác nhau. Hãy cho tôi biết loại cây bạn trồng để tôi giúp bạn xác định thời điểm phù hợp." },
        { "keyword": "tình trạng kho hàng", "response": "Bạn có thể kiểm tra tình trạng kho hàng cho từng sản phẩm trên trang chi tiết sản phẩm." },
        { "keyword": "địa chỉ cửa hàng", "response": "Địa chỉ cửa hàng của chúng tôi có thể được tìm thấy trên trang 'Liên hệ' trên website." },
        { "keyword": "công dụng của phân bón", "response": "Phân bón có nhiều công dụng như cung cấp dinh dưỡng cho cây trồng, giúp cây phát triển khỏe mạnh và tăng năng suất." },
        { "keyword": "tư vấn chọn hạt giống", "response": "Hãy cho tôi biết loại cây bạn muốn trồng để tôi tư vấn cho bạn loại hạt giống phù hợp nhất." },
        { "keyword": "tìm hiểu về sản phẩm", "response": "Nếu bạn muốn tìm hiểu thêm thông tin về một sản phẩm cụ thể, tôi sẽ cung cấp chi tiết ngay cho bạn." },
        { "keyword": "hướng dẫn bảo quản dụng cụ", "response": "Dụng cụ cần được bảo quản ở nơi khô ráo và sạch sẽ để tránh hư hỏng. Cần hướng dẫn cụ thể về dụng cụ nào?" },
        { "keyword": "thời điểm trồng cây", "response": "Thời điểm trồng cây phụ thuộc vào loại cây. Tôi có thể tư vấn thời điểm trồng cây cụ thể theo từng loại." },
        { "keyword": "giải pháp chống hạn", "response": "Chúng tôi có các sản phẩm và phương pháp giúp bạn chống hạn hiệu quả cho cây trồng. Hãy hỏi tôi chi tiết về các giải pháp này." },
        { "keyword": "giải pháp phòng ngừa sâu bệnh", "response": "Chúng tôi cung cấp các sản phẩm phòng ngừa sâu bệnh để bảo vệ cây trồng của bạn. Cần tư vấn về sản phẩm nào?" },
        { "keyword": "hướng dẫn pha chế thuốc trừ sâu", "response": "Bạn cần hướng dẫn pha chế thuốc trừ sâu cụ thể nào? Tôi sẵn sàng cung cấp thông tin chi tiết." },
        { "keyword": "điều kiện bảo quản hạt giống", "response": "Hạt giống nên được bảo quản ở nơi khô ráo, thoáng mát và tránh ánh nắng trực tiếp." },
        { "keyword": "cách sử dụng phân hữu cơ", "response": "Phân hữu cơ cần được bón đúng cách để đạt hiệu quả cao nhất. Tôi sẽ hướng dẫn bạn cách sử dụng đúng cách." },
        { "keyword": "dụng cụ tưới cây", "response": "Chúng tôi có các loại dụng cụ tưới cây, từ bình tưới tay đến hệ thống tưới tự động. Hãy chọn loại bạn cần!" },
        { "keyword": "kích thích tăng trưởng", "response": "Các sản phẩm kích thích tăng trưởng giúp cây phát triển nhanh và khỏe mạnh. Cần tư vấn thêm về sản phẩm nào?" },
        { "keyword": "hướng dẫn bón phân đúng cách", "response": "Bón phân đúng cách giúp cây trồng hấp thụ dinh dưỡng hiệu quả. Tôi có thể hướng dẫn bạn cách bón phân đúng chuẩn." },
        { "keyword": "thông tin về hạt giống đặc biệt", "response": "Chúng tôi có các loại hạt giống đặc biệt như hạt giống cây hiếm và cây trồng mới. Cần thông tin về loại nào?" },
        { "keyword": "hướng dẫn làm đất", "response": "Làm đất đúng cách là yếu tố quan trọng giúp cây trồng phát triển tốt. Hãy cho tôi biết bạn cần hướng dẫn làm đất cho loại cây nào." },
        { "keyword": "công cụ làm vườn", "response": "Chúng tôi có các công cụ làm vườn như cuốc, xẻng, cào, và nhiều dụng cụ khác để hỗ trợ bạn làm vườn." },
        { "keyword": "phân bón hữu cơ", "response": "Phân bón hữu cơ giúp đất trở nên màu mỡ và an toàn cho cây trồng. Cần tư vấn về loại phân hữu cơ nào?" },
        { "keyword": "hướng dẫn cắt tỉa cây", "response": "Cắt tỉa cây đúng cách giúp cây phát triển tốt hơn và tạo hình dáng đẹp mắt. Tôi có thể hướng dẫn bạn cách cắt tỉa cây." },
        { "keyword": "chế độ dinh dưỡng cho cây trồng", "response": "Chế độ dinh dưỡng cần được điều chỉnh theo từng loại cây trồng. Tôi sẽ giúp bạn lựa chọn chế độ dinh dưỡng phù hợp." },
        { "keyword": "điều kiện trồng cây", "response": "Mỗi loại cây trồng đều có những yêu cầu về điều kiện sinh trưởng riêng. Hãy cho tôi biết cây nào bạn muốn trồng để tôi tư vấn." },
        { "keyword": "hỗ trợ vận chuyển", "response": "Chúng tôi hỗ trợ vận chuyển sản phẩm đến nhiều địa phương khác nhau." },
        { "keyword": "sản phẩm đặc biệt", "response": "Hãy kiểm tra các sản phẩm đặc biệt mà chúng tôi hiện có trên website." },
        { "keyword": "tư vấn miễn phí", "response": "Chúng tôi cung cấp dịch vụ tư vấn miễn phí về các sản phẩm nông nghiệp." },
        { "keyword": "hệ thống quản lý", "response": "Hệ thống quản lý đơn hàng của chúng tôi giúp bạn theo dõi tình trạng đơn hàng dễ dàng." },
        { "keyword": "mua lẻ", "response": "Chúng tôi bán cả sản phẩm lẻ và bán buôn. Hãy chọn hình thức bạn cần." },
        { "keyword": "sản phẩm khuyến mãi", "response": "Các sản phẩm khuyến mãi hiện có được cập nhật trên trang chính." },
        { "keyword": "cập nhật sản phẩm", "response": "Sản phẩm mới sẽ được cập nhật thường xuyên trên website của chúng tôi." },
        { "keyword": "chọn sản phẩm", "response": "Hãy lựa chọn sản phẩm bạn muốn từ danh sách để thêm vào giỏ hàng." },
        { "keyword": "điều kiện đổi trả", "response": "Để đổi trả sản phẩm, vui lòng tham khảo điều kiện đổi trả trên website." },
        { "keyword": "giá cả cạnh tranh", "response": "Chúng tôi cam kết giá cả cạnh tranh nhất trên thị trường." },
        { "keyword": "làm gì khi gặp vấn đề", "response": "Nếu gặp vấn đề, hãy liên hệ ngay với chúng tôi để được hỗ trợ." },
        { "keyword": "sản phẩm tươi mới", "response": "Chúng tôi luôn đảm bảo sản phẩm của mình là hàng tươi mới và chất lượng." },
        { "keyword": "bảng giá", "response": "Bạn có thể xem bảng giá chi tiết của từng sản phẩm trên website." },
        { "keyword": "thời gian xử lý", "response": "Thời gian xử lý đơn hàng của chúng tôi dao động từ 1-2 ngày làm việc." },
        { "keyword": "chất liệu sản phẩm", "response": "Thông tin về chất liệu của sản phẩm có sẵn trên trang chi tiết sản phẩm." },
        { "keyword": "ưu đãi đặc biệt", "response": "Đừng bỏ lỡ các ưu đãi đặc biệt trên website của chúng tôi." },
        { "keyword": "danh sách yêu thích", "response": "Bạn có thể lưu sản phẩm vào danh sách yêu thích để xem sau." },
        { "keyword": "tài khoản khách hàng", "response": "Tạo tài khoản để quản lý đơn hàng và nhận thông báo khuyến mãi." },
        { "keyword": "hướng dẫn sử dụng", "response": "Hãy tham khảo hướng dẫn sử dụng sản phẩm trên website." },
        { "keyword": "quản lý giỏ hàng", "response": "Bạn có thể quản lý giỏ hàng của mình ngay trên trang giỏ hàng." },
        { "keyword": "mã giảm giá", "response": "Nhập mã giảm giá khi thanh toán để nhận ưu đãi." },
        { "keyword": "chăm sóc khách hàng nhanh chóng", "response": "Dịch vụ chăm sóc khách hàng của chúng tôi sẵn sàng hỗ trợ bạn ngay lập tức." },
        { "keyword": "hướng dẫn thanh toán", "response": "Chúng tôi có hướng dẫn thanh toán chi tiết trên website." },
        { "keyword": "hàng chính hãng", "response": "Tất cả sản phẩm của chúng tôi đều là hàng chính hãng và được đảm bảo chất lượng." },
        { "keyword": "thời gian phản hồi", "response": "Chúng tôi sẽ phản hồi bạn trong vòng 24 giờ làm việc." },
        { "keyword": "cách bảo quản", "response": "Hãy tham khảo cách bảo quản sản phẩm để giữ chất lượng lâu dài." },
        { "keyword": "tình trạng sản phẩm", "response": "Hãy kiểm tra tình trạng sản phẩm để biết sản phẩm có sẵn hay hết hàng." },
        { "keyword": "chế độ bảo hành", "response": "Chúng tôi cung cấp chế độ bảo hành cho một số sản phẩm nhất định." },
        { "keyword": "số điện thoại", "response": "Nếu cần hỗ trợ, hãy liên hệ với chúng tôi qua số điện thoại trên website." },
        { "keyword": "hạn chế sản phẩm", "response": "Một số sản phẩm có thể bị hạn chế số lượng. Xin vui lòng kiểm tra." },
        { "keyword": "nhận hàng", "response": "Hãy kiểm tra kỹ hàng hóa khi nhận để đảm bảo không có lỗi." },
        { "keyword": "quy trình xử lý đơn hàng", "response": "Quy trình xử lý đơn hàng của chúng tôi được thực hiện nhanh chóng và hiệu quả." },
        { "keyword": "hướng dẫn mua hàng", "response": "Chúng tôi có hướng dẫn chi tiết về cách mua hàng trên website." },
        { "keyword": "dịch vụ tư vấn", "response": "Cần tư vấn thêm về sản phẩm? Chúng tôi sẵn sàng hỗ trợ bạn." },
        { "keyword": "ưu tiên giao hàng", "response": "Hãy chọn ưu tiên giao hàng nhanh nếu cần nhận hàng sớm hơn." },
        { "keyword": "khiếu nại", "response": "Nếu có khiếu nại, vui lòng liên hệ với chúng tôi để được giải quyết nhanh chóng." },
        { "keyword": "địa chỉ giao hàng", "response": "Hãy chắc chắn cung cấp địa chỉ giao hàng chính xác khi đặt hàng." },
        { "keyword": "mẫu mã sản phẩm", "response": "Bạn có thể lựa chọn mẫu mã sản phẩm yêu thích trên website." },
        { "keyword": "tìm sản phẩm theo loại", "response": "Hãy chọn loại sản phẩm bạn muốn từ menu lọc để tìm nhanh hơn." },
        { "keyword": "khả năng tồn kho", "response": "Hãy kiểm tra khả năng tồn kho để biết sản phẩm có sẵn hay không." },
        { "keyword": "phân phối", "response": "Chúng tôi phân phối sản phẩm tới các khu vực trên toàn quốc." },
        { "keyword": "giới thiệu sản phẩm", "response": "Hãy xem phần giới thiệu sản phẩm để hiểu thêm chi tiết về sản phẩm đó." },
        { "keyword": "thông tin chi tiết", "response": "Thông tin chi tiết về sản phẩm có thể được tìm thấy trên trang sản phẩm." },
        { "keyword": "sự kiện đặc biệt", "response": "Hãy tham gia các sự kiện đặc biệt để nhận nhiều ưu đãi." },
        { "keyword": "lựa chọn sản phẩm", "response": "Chúng tôi cung cấp nhiều sự lựa chọn cho từng nhu cầu cụ thể." },
        { "keyword": "hàng hóa hết hàng", "response": "Nếu hàng hóa hết, bạn có thể đăng ký nhận thông báo khi có hàng trở lại." },
        { "keyword": "dịch vụ chăm sóc", "response": "Chúng tôi luôn sẵn sàng chăm sóc khách hàng để đảm bảo sự hài lòng." },
        { "keyword": "tư vấn sản phẩm", "response": "Hãy cho chúng tôi biết nhu cầu của bạn để được tư vấn sản phẩm phù hợp." },
        { "keyword": "giá bán", "response": "Giá bán của từng sản phẩm được hiển thị rõ ràng trên website." },
        { "keyword": "cập nhật tin tức", "response": "Hãy theo dõi website để cập nhật các tin tức mới nhất." },
        { "keyword": "cách thức giao hàng", "response": "Chúng tôi cung cấp nhiều cách thức giao hàng phù hợp với nhu cầu của bạn." },
        { "keyword": "quy trình trả hàng", "response": "Quy trình trả hàng được thực hiện theo các bước hướng dẫn trên website." },
        { "keyword": "hạn mức thanh toán", "response": "Hãy kiểm tra hạn mức thanh toán của bạn khi đặt hàng." },
        { "keyword": "số lượng tối đa", "response": "Số lượng tối đa cho mỗi lần mua có thể được quy định trên từng sản phẩm." },
        { "keyword": "tạo tài khoản", "response": "Tạo tài khoản để tiện theo dõi đơn hàng và nhận thông báo ưu đãi." }
       
    ]
}

